const proviceReg = /湖南|北京|浙江|江苏|东方|安徽|黑龙江|辽宁|深圳|广东|天津|湖北|山东|重庆|河南|陕西|吉林|广西|河北|西藏|内蒙古|青海|四川|山西|新疆|云南|江西|福建东南|贵州|甘肃|海南|厦门|宁夏/
// tai wan
const tw = /東森新聞|东森新闻|東森電影|东森电影|中天新闻|中天综合|中天娱乐|中視综合|中视综合|华视综合|年代新聞|年代新闻|八大綜合|八大综合|世纪综合|信吉電視|信吉电视|信吉电视|人間衛視|人间卫视|唯心電視|唯心电视|卫视卡视|国家地理|百事通台|MTV音乐|HBO2|动物星球|动物世界|歐美影院|欧美影院|亞洲影院|亚洲影院|华纳电影|福克斯电影|福克斯动作|衛星劇場|卫星剧场|经典频道|大众影视|居家幸福|国会频道|靖天|MTV|FOX|Elta|博斯|龙华电影|龙华动画|龙华经典|龙华偶像|龙华戏剧|龙华洋片|龙华影剧|龙祥时代|民视|美亚电影台|年代新闻|全美电视|日舞电影|三立|台视|台湾|华视|寰宇新闻|镜电视/
// xiang gang
const xg = /凤凰卫视|凤凰资讯|香港|TVB|翡翠台|翡翠明珠|翡翠综合|明珠台|HKS卫视|香港卫视|无线新闻|亚旅卫视|赛马频道/
// jingqu
const jq = /峨眉山|宁夏大漠孤烟|映秀新城|福建华安土楼|梅州梅江|河南二七塔|鼓浪屿遥望厦门岛|舟山东极岛|福建三坊七巷|武汉两江四岸|四川达古冰川|广西崇左白头猴国家级自然保护区|桂林象鼻山|广州塔和海心桥|全国风景总览|黟县宏村月沼|黟县宏村南湖|黟县西递牌坊|黟县西递半山亭|黟县卢村远眺|九寨沟|南昌滕王阁|黄山始信峰|黄山卧云峰|黄山梦笔生花|黄山排云亭|黄山西海峡谷|黄山光明顶|黄山信兴道|黄山平天矼|黄山飞来石|云台山红石硖|泰山黄岘岭|泰山望人松|泰山大观峰|泰山拱北石|济南千佛山望泉城|泰山玉皇顶|泰山天街|淳安界首渔港码头|新疆红山|远眺万佛顶|武夷山玉女峰|印象大红袍|无锡惠山二茅峰望锡城|张家界迷魂台|张家界水绕4门|张家界将军列队|张家界阿凡达悬浮山|凤凰古城|凤凰古城南华山|宠村月沼|重庆开州城区|黄花城水长城1|黄花城水长城2|黄花城水长城3|黄花城水长城4|天津滨海新区|天津滨海新区2|吉安井冈山红旗广场|峨眉云海日出|贡嘎雪山|太原长风商务区|悬空寺全景|张家界玻璃桥|车八岭国家自然保护区|伊犁巩留县蝶湖公园|重庆洪崖洞|南天一柱|宁夏上滩村|雪乡大石碑|雪乡梦幻家园|观景台|江西武功山云顶|嵌雪楼|﻿丹霞山丹梯铁锁|韶音亭|坝达景点观景台|多依树景点|普高老寨|老虎嘴|山涧栈道|七曲山风景区|山西省宋家沟村|武夷山玉女峰|华山|甘坑客家小镇|十八洞村|桂林象山公园|鼋头渚赏樱阁|峡谷石林|内蒙古云计算信息园|宁夏回族上滩村|甘肃火星1号基地|六角亭瀑布|深圳世界之窗|远眺贡嘎雪山|普贤菩萨铜像|远眺万佛顶|凤凰古城东关门|凤凰古城南华山|芦村远眺|西递半山亭|西递牌坊|宏村月沼|云台山-小寨沟|云台山-百家岩|云台山-红石峡|福建宁德太姥山景区|崇圣寺三塔中景|崇圣寺三塔湖面|崇圣寺三塔远景|西汉南越王博物馆|醉美沙滩翡翠湾|漳州六鳌翡翠湾|云龙山观景台西|云龙山观景台南|趵突泉|厦门鼓浪屿|玉液湖|蓝月谷|印象实景|千岛湖|黟县·西递牌坊|乌镇·西市河|蓝印花布|龙形田|乌镇全景|鸣沙山山门|鸣沙山|鸣沙山月牙泉|哈尼梯田|青海湖|八达岭长城南七楼|八达岭长城北十楼|嘉峪关关城|四姑娘山幺妹峰|隆珠措|九华山拜经台|九华山|九华山花台|天界山-玻璃栈道|天界山-桃花湾瀑布|天山-定海神针|天山-海西平台|天山-马牙山|天山-灯杆山|西线玻璃栈道|天门洞|天空步道|云梦仙顶|大容山莲花山顶|南京玄武湖公园|江苏南京牛首山|郑东新区千玺广场|湖南岳阳楼|西藏米林拉林铁路|四川凉山邛海景区|贵阳甲秀楼|宁夏黄河漂流|江苏聚龙湖|大研花巷观景|内蒙古额济纳胡杨林|天津滨海新区|五彩池|争艳彩池|黄龙望乡台|黄龙洗身洞/

export function handleUserGroup(name: string) {
    const userGroup = localStorage.getItem("create-group-dialog-text") || ""
    if (userGroup) {
        const userGroupLines = userGroup.split("\n")
        for (const userGroupLine of userGroupLines) {
            const [groupName, groupValues] = userGroupLine.split(":")
            if (groupValues) {
                const values = groupValues.split("#")
                for (const value of values) {
                    if (new RegExp(value).test(name)) {
                        return groupName
                    }
                }
            }
        }
    }
}

export function defaultGroup(name: string) {
    // 处理用户自定义的group
    const groupName = handleUserGroup(name)
    if (groupName) return groupName

    if (xg.test(name)) {
        return "香港"
    } else if (tw.test(name)) {
        return "台湾"
    } else if (/澳门有线|澳门|莲花卫视|澳视体育|澳亚卫视|澳门资讯|澳门卫星|澳门卫视/.test(name)) {
        return "澳门"
    } else if (/湖南卫视|北京卫视|浙江卫视|江苏卫视|东方卫视|安徽卫视|黑龙江卫视|辽宁卫视|深圳卫视|广东卫视|天津卫视|湖北卫视|山东卫视|重庆卫视|河南卫视|陕西卫视|吉林卫视|广西卫视|河北卫视|西藏卫视|内蒙古卫视|青海卫视|四川卫视|山西卫视|新疆卫视|云南卫视|江西卫视|福建东南卫视|贵州卫视|甘肃卫视|兵团卫视|东南卫视|海南卫视|康巴卫视|厦门卫视|宁夏卫视|延边卫视/.test(name)) {
        return "卫视"
    } else if (proviceReg.test(name)) {
        const res = name.match(proviceReg) || []
        return res[0] || "其它"
    }
    else if (/中国3D电视试验频道|外汇理财|电竞天堂|IPTV|CCTV4K|中数|CHC|华数求索|北广/.test(name)) {
        return "数字付费"
    }
    else if (/CCTV|cctv|CGTN|CNC|清华大学电视台|新华英语/.test(name)) {
        return "央视"
    } else if (/黑莓电竞|哈哈炫动|卡通|动画|少兒|少儿|蜡笔小新|熊大|樱桃小丸子|小猪佩寄|柯南/.test(name)) {
        return "少儿"
    } else if (jq.test(name)) {
        return "景区"
    } else if (/之声|广播/.test(name)) {
        return "电台"
    }
    else if (/[\u0800-\u4e00]/.test(name)) {
        return "日本"
    }
    else if (/[\uac00-\ud7ff]/.test(name)) {
        return "韩国"
    }
    else if (/法国|俄罗斯|新加坡|日本|新马|越南|朝鲜|韩国|美国|斯洛伐克|阿联酋|以色列|澳大利亚/.test(name)) {
        return "海外"
    }
    else {
        return "其它"
    }
}